{
  "writings": [
  {
    "title": "The Disease",
    "description": "A story of friendship and sickness",
    "content": "Frank and I had been best friends for as long as I could remember. We grew up on the same street, shared classes, and slogged through the same dead-end jobs in our twenties. He was the guy who could light up a room with a joke, the one who made the worst situations bearable. I thought I knew everything about him—every fear, every dream, every quirk. But I didn’t know how easily someone could unravel, even someone as steady as Frank.



It started small, with things easy to brush off. He’d mention headaches and trouble sleeping, things we chalked up to stress. “Getting old sucks, Richie,” he’d say, grinning like it wasn’t a big deal. He was 34. Too young to be blaming things on age. A few weeks later, the grin faded. He started forgetting little things—his wallet, his keys, how to get to places he knew like the back of his hand.



The first time he got lost driving us to the diner we’d gone to for years, we both laughed it off. “Guess my brain’s on vacation,” he said, but the laugh didn’t quite land. Soon, the memory lapses gave way to mood swings. Frank, the guy who never let anything rattle him, started snapping at strangers over nothing. He yelled at a cashier for bagging his groceries wrong, then broke down crying in the parking lot. “I don’t know what’s happening to me,” he admitted, his voice trembling in a way I’d never heard before.



I convinced him to see a doctor. They ran tests—bloodwork, scans, more scans. Weeks passed, and then came the call. The diagnosis wasn’t a diagnosis at all. “They have no fucking idea,” Frank said bitterly, forcing a grin that didn’t reach his eyes. “Not Alzheimer’s, not Parkinson’s, not CJD, not…” He rattled off a list of things the doctors had ruled out, each name more unfamiliar than the last. The absurdity of it made it hard to take in. How could they not know? But the fear set in quickly. Whatever this was, it was taking Frank apart, piece by piece.



His coordination faltered; he started tripping over flat ground and fumbling with things like buttons and shoelaces. He’d try to laugh it off, but the fear behind his jokes was impossible to miss. Then came the hallucinations. He started seeing things no one else could—faces in windows, shadows in the corners of the room. “They’re watching me,” he whispered once, his grip on my arm iron-tight, his blue eyes wide and frantic. The paranoia grew worse. He accused me of stealing from him, of plotting against him. It broke something in me every time I saw him look at me like I was a stranger.



There were moments when the old Frank would shine through. He’d crack a joke, flash that lopsided smile, and for a second, I’d let myself hope. But those moments became rarer, then disappeared entirely.



By the time he was hospitalized, Frank was a shell of the man I knew. He couldn’t talk, couldn’t even meet my gaze. His body was there, but he wasn’t. I’d sit by his bed, telling him stories—about the time we snuck into old man Miller’s apple orchard or the summer we spent fixing up his dad’s rusty car. I told myself that somewhere, some part of him could hear me. I wanted to believe that.



Frank passed away six months after the symptoms first appeared. They said it was peaceful. I don’t know how they could be sure. I like to think he found peace somehow, that he’s in a place where the shadows can’t reach him, where his mind is his own again.



What happened to Frank didn’t end with him. By the next year, dozens of similar cases had popped up across the country—young, healthy people falling apart in ways that left doctors baffled. Scientists called it Neurodegenerative Syndrome X, but that was just a placeholder for a disease they didn’t understand. By 2026, the numbers were impossible to ignore. Thousands turned to millions. Entire families succumbed. Entire towns emptied.



The news was relentless. Death tolls, theories, government officials contradicting each other. Was it a new prion disease? A virus? Something environmental? Answers never came fast enough. Travel bans were imposed. International borders closed. Scientists raced against the clock, but the clock didn’t care. Whatever this was, it didn’t care about borders or money or power. It devoured everything.



Frank was just one of millions. One of the first, really. His story isn’t unique anymore. But that doesn’t make it any less important. I still think about him—his laugh, his crooked smile, the way he could turn even the worst day into something bearable. I hold onto those memories, because they’re all I have left.



And as long as I remember him, he’s not really gone. Not entirely."
  },
  {
    "title": "The Vial",
    "description": "A Story About a Mother ",
    "content": "Anna sat in the hospital’s dimly lit waiting room, clutching a threadbare stuffed rabbit that once belonged to Lily. The smell of antiseptic and stale coffee filled the air. The doctors had told her there was nothing more they could do, but Anna refused to accept that. She had spent the past two days combing the city, desperate for anything that might save her daughter. Clinics, herbalists, even the back-alley “healers” that whispered promises of miracles for the right price. She had heard “no” more times than she could count, and the weight of it crushed her.



Anna wasn’t always the type to break. She’d raised Lily on her own since her husband left, balancing two jobs while holding the fraying edges of her life together. She prided herself on being pragmatic and tough, on solving her own problems. But this was different. This was her child.



The hum of traffic outside was constant, broken only by the occasional wail of a siren in the distance. Anna sat slumped on a worn-out couch in their cramped apartment, staring blankly at the muted TV. Lily lay on the pullout bed in the corner of the room, her tiny body wrapped in a cocoon of blankets. The fluorescent lights buzzed overhead, flickering faintly, their harsh glow accentuating the shadows under Anna’s eyes.



The doctors had sent them home days ago, with nothing but sympathy and a few useless prescriptions. Lily’s illness defied diagnosis, somehow a mystery to modern medicine. Her fever climbed higher every hour, her skin pale and clammy. The little girl was slipping away, and Anna was powerless to stop it.



Anna buried her face in her hands, fighting back tears. Bills were piled on the table, unopened. Her phone buzzed again with messages from her sister, offering help Anna didn’t know how to accept. The city buzzed and roared around them, indifferent to her despair.



As she sat there, a soft knock sounded at the door.



She froze. It was late…much too late for visitors. Peering through the peephole, she saw a hunched figure draped in a threadbare coat. The man’s face was obscured by shadows, but something about his presence unsettled her.



“Who is it?” she called, her voice hoarse.



The man’s voice was gravelly but oddly gentle. “You’re searching for hope, aren’t you?”



Anna’s heart skipped a beat. “What do you mean?”



The man didn’t answer, but a card slid through the gap beneath the door. When Anna hesitated, his voice came again, softer this time. “We know you love Lily. We will help.”



By the time Anna flung the door open, the hallway was empty. The only trace of him was the card still clenched in her shaking hands.



Anna collapsed against the doorframe, her breathing shallow as she clutched the card in her hand. From the living room, Lily’s weak cries pierced the silence, her voice faint and broken, like the whisper of someone lost. “Mommy… it hurts.” 



Anna rushed to her side, dropping to her knees as Lily’s tiny body convulsed, her skin pale and clammy. She pressed her hand to Lily’s forehead and it burned like fire. The thermometer blinked uselessly on the table, the numbers meaningless now. Anna’s heart pounded in her chest as she realized there was nothing left to try, no more time to wait for help that wouldn’t come. The card crumpled slightly in her fist as she glanced at it, her tears blurring the address. 



The address on the card led Anna to a dingy apothecary tucked between two shuttered stores on a street she didn’t recognize. On a worn sign above the store it read Blackthorn Remedies. A quick Google search found no information, and the store wasn’t even listed on any map.



Inside, the shop was dark and cluttered, with shelves lined with jars of unrecognizable powders and dried herbs. An old woman sharply eyed Anna as she took a look around.



Anna approached the counter hesitantly. “Excuse me… can you help me?” she asked, her words trembling under the weight of her desperation.



The old woman behind the counter looked up slowly, her sharp gray eyes locking onto Anna’s with an unsettling calm. Anna swallowed hard, gripping the card tightly in her trembling fingers. “A man came to my apartment last night,” she began, her words spilling out in a rush. “He gave me this card—your address. He said you might be able to help. My daughter… she’s—she’s dying.” She held the card out, her eyes wide and pleading, desperate for even a shred of hope.



The woman’s face remained impassive, her expression unreadable. For what felt like an eternity, she simply stared, as though weighing something unseen. Then, at last, she spoke. “Would you do anything for Lily?”



Anna froze, a chill running down her spine. Her breath caught in her throat. She hadn’t mentioned her daughter’s name. “How do you…?”



The woman ignored the question, reaching beneath the counter with deliberate movements. When her hand reappeared, it held a small vial. Its liquid contents shimmered faintly, shifting and swirling in unnatural colors that seemed to defy logic. It didn’t look like any medicine or even water Anna had ever seen.



“What is it?” Anna asked, her voice barely steady, her gaze fixed on the vial.



The old woman’s voice was low and steady. “It’s the price you’re willing to pay for your daughter.”



“Price?” Anna asked, her heart thudding painfully in her chest. “What price?”



The woman’s lips twitched, though it was unclear if it was amusement or something darker. “That’s not for me to say. The cost is different for everyone.”



Anna’s instincts screamed at her to leave, to run, but her mind was filled with the image of Lily—so weak, her breaths shallow, her eyes dull. Gasping for air, slipping further away with each moment. Without a word, Anna reached for the vial.



The old woman’s grip shot out, her hand closing around Anna’s wrist. Her skin was ice-cold. “It works slowly,” the woman said, her tone firm and foreboding. “Don’t expect miracles overnight. And don’t come back asking for a refund if you regret it.”



Her eyes, sharp and knowing, seemed to pierce through Anna, holding something deep, something Anna couldn’t name but instinctively feared. Anna yanked her hand away, the vial clutched tightly in her grasp, and without another word, she fled the apothecary.



 

The streets felt colder as she walked home, her mind a storm of conflicting thoughts. The vial burned in her pocket, its weight heavier than it had any right to be. She couldn’t shake the old woman’s words—or the way she had known Lily’s name.



When Anna arrived home, the apartment was suffocatingly silent except for Lily’s strained, labored breaths. Her daughter lay curled on the couch, her tiny body trembling beneath the blankets. Her lips were cracked, her skin clammy, and her hair clung to her damp forehead. Anna rushed to her side, tears welling as Lily turned her dull eyes toward her.



Anna hovered over Lily’s bedside, the vial trembling in her hands. The old woman’s words echoed in her head, but as Lily let out a weak cry in her fevered sleep, Anna’s resolve hardened.



“Mommy?” Lily’s voice was barely audible, the effort of speaking seeming too much.



I’m here, sweetheart, and I’m not going anywhere,” Anna said, brushing the hair from her daughter’s face. Her voice was calm, but the words felt like a plea, more to herself than to Lily. As she held her daughter’s hand, Anna whispered it again, almost like a prayer. “I’m here. I’m not going anywhere.”



“I don’t want to go,” Lily whispered.



The words broke something in Anna. Her hands trembled as she pulled the vial from her pocket, staring at the swirling liquid inside. What was it? Medicine? Would it help? How was there a price to getting better? She had no answers…only an overwhelming desperation to save her daughter.



With trembling fingers, Anna uncorked the vial. A faint, sweet scent wafted into the air, delicate and inviting. It didn’t smell like medicine—it smelled like wildflowers after rain, like a memory from a life Anna barely remembered.



“Hold on, Lily,” she whispered, lifting her daughter’s head gently. “Just a sip. This will help.”



Anna tipped the vial to Lily’s lips. The liquid slid down easily, glowing faintly as it disappeared. Lily shuddered, a soft gasp escaping her lips. For a moment, Anna thought nothing would happen. Then Lily’s breathing slowed, her frail body relaxing slightly.



Hours passed. Lily’s fever broke slightly, but she remained weak, her skin still pale, her breathing still shallow. It was enough to give Anna hope, but not enough to ease her fears.



Over the next few days, Lily’s condition improved gradually. The first signs were small—her cough grew less severe, her cheeks regained a faint blush of color. Then came moments where she opened her eyes, gazing at Anna with a weak but steady focus.



Anna stayed by her side constantly, hardly sleeping. Her exhaustion clung to her like a second skin, but the thought of leaving Lily alone filled her with dread. Even when Lily seemed to rest, Anna would sit by the bed, muttering softly to herself.



“I’m here, sweetheart, and I’m not going anywhere,” she whispered, her voice hoarse from lack of sleep. The words repeated like a mantra, her grip on Lily’s hand tightening each time she said it.



At some point, Anna began to hear her own voice echo in the silence, as though someone else were whispering it back to her. She told herself it was exhaustion, nothing more.



 As the days passed, Anna began to notice things—Lily’s heartbeat, once faint and irregular, now beat with a stronger, almost rhythmic power. At first, she clung to the sound as proof that the vial was working, but there was something about the rhythm that made her uneasy.



The dark circles under Lily’s eyes faded, but in their place, her irises seemed to deepen in hue, a richer brown than Anna remembered. When Lily caught Anna staring, she smiled—too wide, as if she knew something Anna didn’t. Anna shook her head, trying to dismiss the unease creeping into her chest. But the thought wouldn’t leave her: What exactly had she given her daughter?



As the days passed, Anna allowed herself to hope, but her unease also grew. It seemed like for every bit of the sickness that went away, Lily grew more and more restless. Her daughter would wander aimlessly around the apartment, stopping to stare at nothing or muttering under her breath. One afternoon, Anna caught her sitting cross-legged by the window, drawing strange shapes on the fogged glass with her fingertip.



“Sweetheart, what are you doing?” Anna asked, her voice tight.



“Just writing it down,” Lily replied without looking up.



“Writing what down?”



Lily paused for a long moment, then turned her head slowly. “The names,” she whispered.



Anna’s chest tightened. “Names? What names?”



“They are whispering them,” Lily said “You can’t hear them yet?”



Anna’s blood ran cold. She wanted to comfort Lily, to tell her it would all be okay, but the words that came out instead were automatic, almost mechanical.



“I’m here, sweetheart, and I’m not going anywhere,” Anna said. The words felt heavier now, almost suffocating in their repetition, as though they didn’t belong to her anymore. Lily’s gaze flickered to her, and for a brief moment, her lips curled into a small, faint smile.



As Lily’s behavior grew stranger, so did Anna’s. She stopped answering her sister’s texts, stopped opening the bills piling up on the table. She couldn’t even bring herself to leave the apartment to get groceries. Every time she tried to step out the door, a suffocating panic gripped her chest, and she found herself retreating to Lily’s side.



One afternoon, as she sat by Lily’s bed, the sound of whispers filled the room—not from Lily this time, but from the drawer where Anna had locked the empty vial. She froze, her breath catching, but the whispers grew louder, weaving into words that made her blood run cold:



“I’m here, sweetheart, and I’m not going anywhere.”



Anna slammed the drawer shut and dragged a chair in front of it, her heart racing. She spent the rest of the day clutching Lily’s hand, repeating the phrase over and over, louder each time, as though trying to drown out the whispers.



There were times Anna would find her pacing the apartment in short, frantic bursts, mumbling under her breath. She wouldn’t eat or sleep, and her once soft demeanor became sharp, impatient. One evening, Anna tried to coax Lily to sit down for dinner, but her daughter only stared at the plate of food with disdain.



“Don’t you want a little bite? You have to keep your strength up,” Anna pleaded.



Lily giggled, the sound too loud and strange. “I don’t need it anymore, Mommy,” she said, her tone sing-song. “I’m full already.”



Anna blinked. “Full? From what?”



Lily then clapped a hand over her mouth, as if she’d said too much. She darted away before Anna could press her further.



The moments of strangeness began to stack. One night, Anna awoke to find Lily standing in the doorway, her eyes reflecting the faint glow of the streetlights. Anna’s heart jumped, and before she could stop herself, the words spilled from her lips:



“I’m here, sweetheart, and I’m not going anywhere.”



Lily didn’t respond right away. She just stared at Anna, her head tilted at that unnatural angle. When she finally spoke, her voice was soft but chilling.



“I know, Mommy,” she said. “I know you’ll always do everything you can to stay.”



Anna felt a cold sweat break out on her skin.



“I was just checking,” Lily added, her voice calm.



“Checking what?” Anna asked, her throat tight.



Lily tilted her head, her lips curling into that unsettling smile. “If you’re still here.”



Anna tried to dismiss her unease, chalking it up to recovery, but deep down, she knew something was really wrong.



One night, she woke to find Lily standing by the window, staring out into the city. Her silhouette was unnerving—her frame too still, her head tilted at an unnatural angle.



“Lily?” Anna called softly.



Her daughter turned slowly, her face illuminated by the streetlights. For a moment, Anna didn’t recognize her. Lily’s eyes glimmered with an intensity that wasn’t human, and her smile was too wide, too knowing.



“Mommy,” Lily said, her voice cold. “Do you hear them?”



“Hear what?” Anna whispered, her pulse quickening.



“The whispers,” Lily replied, stepping closer. “They’re everywhere now. They’re so loud.”



Anna shook her head, backing away. “What are you talking about?”



Lily stopped, her expression softening. “I’m scared Mommy.” she said, her voice barely above a whisper. “They won’t leave me alone. They said it’s time to go with them.” Tears were rolling down Lily’s face, her eyes filled with fear.



Anna’s heart shattered at the sight of her daughter’s tears. She reached out, pulling Lily into a tight embrace. “It’s okay,” she murmured. “I’ve got you and I won’t go anywhere.”



But in the days that followed, Lily’s condition worsened. The whispers she spoke of seemed to infect her mind, twisting her thoughts and actions. Anna began to hear faint murmurs, too—soft, insidious voices that seemed to emanate from the vial, which now sat sealed in a drawer.





Anna knew something was wrong. Lily’s entire personality began to shift subtly as well. At first, it was welcome, when she was first recovering. She was more animated, curious about the world in a way she hadn’t been during her illness. But soon, her energy became relentless, almost manic. She asked strange questions about things she shouldn’t know: the names of people Anna had never mentioned, places they had never been.



One evening, as they sat at the table for dinner, Lily reached for Anna’s hand. “Mommy, do you ever hear them?”



“Hear what?” Anna asked, startled.



“The voices,” Lily said softly, her gaze faraway. “They talk to me when it’s quiet.”



Anna froze, her pulse quickening. “What do they say?”



“They tell me stories,” Lily replied, her tone casual, as though it were the most natural thing in the world. “About before.”



“Before what?”



Lily’s lips curved into a small, cryptic smile. “I don’t know. I can’t remember yet.”



As weeks passed, Lily’s recovery became the talk of the neighborhood. Neighbors dropped by to check in, remarking on the miracle of her health. Anna smiled and nodded but avoided their questions, unable to explain the truth without sounding insane.



But behind closed doors, things were unraveling. Lily’s behavior grew increasingly erratic. She would disappear for hours, only to be found staring out the window or sitting cross-legged on the floor, humming tuneless melodies. She stopped calling Anna “Mommy,” addressing her instead by her first name.



And then there were the dreams.



Anna began waking in the middle of the night to the sound of whispers—not from Lily, but from her own voice. I’m here, sweetheart. I’m not going anywhere. The words echoed from the corners of the room, slipping into her mind even when she tried to block them out.



One night, she stood in front of the mirror in the bathroom, staring at her reflection. Her lips moved soundlessly at first, but then she heard it—her own voice, low and unrecognizable.



“I’m here, sweetheart, and I’m not going anywhere.”



Anna clutched the sink, shaking. “Stop,” she whispered. But the words only grew louder, until they filled the room, hundreds of versions of her voice chanting endlessly.



One night, she woke to find Lily standing by her bed. Her daughter’s eyes, once warm and familiar, seemed darker, colder.



“Anna,” Lily said softly. “Do you trust me?”



Anna’s throat tightened. “Of course, sweetheart.”



Lily’s smile was faint, almost pitying. “Then you don’t need to be afraid.”



But Anna was. She didn’t know what her daughter had become—or if Lily was still Lily at all.



Desperation drove Anna to research, to call hospitals, to search for the man who had delivered the card. But every lead ended in dead ends and unanswered questions.



Upon returning to the apothecary, she found it to be completely gone. Just two shuttered businesses sitting next to each other, no sign of any other store ever having existed in the spot. Anna had no answers,no hope, and the awful feeling that something terrible is about to happen. 



One evening, Anna found Lily sitting cross-legged in the middle of the room, humming a low, haunting tune. Around her were patterns drawn in spilled sugar, intricate and unrecognizable.



“What are you doing?” Anna demanded, fear creeping into her voice.



Lily looked up, her eyes distant. “They told me I need to go back.”



Anna froze. “Go back where?”



Lily didn’t answer.





Days later, Anna woke to find Lily gone. The apartment door was wide open, the vial missing.



The police searched for weeks but found nothing. It was as if Lily had vanished into thin air.



Anna remained in the apartment, haunted by guilt and unanswered questions. The whispers never stopped, growing louder with each passing day.



One night, she found something near the edge of Lily’s bed—a piece of paper torn from Anna’s own notebook. On it, in Lily’s shaky handwriting, was the mantra Anna had repeated endlessly:



“I’m here, sweetheart, and I’m not going anywhere.”



Anna stared at the words, tears streaming down her face. She whispered into the quiet, her voice trembling. “I’m still here, Lily. I’m not going anywhere.”



Anna reached for the drawer where the empty vial rested, her hands shaking, as if it might still hold some answer, some hope. But it was silent, its once-faint hum now gone, leaving her with nothing but the weight of her choices.



And late at night, when the city was quiet, she swore she could hear Lily’s voice calling out to her.



“Mommy, help me.”



But she could never find her.

"
  }
]
